In [26]:
import pandas as pd
import numpy as np

In [27]:
pd.options.display.float_format = '{:.2f}'.format

## read the JSON file that you saved in ex02

In [28]:
df = pd.read_json('../data/auto.json', orient='records')

## Result

In [29]:
# df

## enrich the dataframe using a sample from that dataframe

In [30]:
df_sample = df.sample(n=200, random_state=21)

In [31]:
concat_rows = pd.concat([df, df_sample], ignore_index=True)

## Result

In [32]:
# concat_rows

## enrich the dataframe concat_rows by a new column with the data generated

In [33]:
np.random.seed(21)

In [34]:
year = pd.Series(data=[np.random.randint(1980, 2020) for _ in range(925)], name='Year')

In [35]:
fines = pd.concat([concat_rows, year], axis='columns')

## Result

In [36]:
# fines

## enrich the dataframe with the data from another dataframe

In [37]:
df_surnames = pd.read_json('../data/surname.json')
df_surnames.set_axis(df_surnames.iloc[0], axis='columns', inplace=True)
df_surnames = df_surnames.drop(0).reset_index(drop=True)

In [38]:
# df_surnames

In [42]:
n = fines['CarNumber'].unique().shape[0]
series_surnames_name = df_surnames['NAME']
series_surnames_name.rename('SURNAME', inplace=True)
surnames_sample = series_surnames_name.sample(n=n, random_state=21, replace=True)
surnames_sample.reset_index(drop=True, inplace=True)

In [43]:
# surnames_sample

0      RICHARDSON
1            ROSS
2          MORGAN
3          BAILEY
4           LOPEZ
          ...
526      CAMPBELL
527          HALL
528         BAKER
529          DIAZ
530        MORGAN
Name: SURNAME, Length: 531, dtype: object

In [44]:
owners = pd.DataFrame(data=surnames_sample)
owners['CarNumber'] = df['CarNumber'].unique()

In [45]:
# owners

        SURNAME     CarNumber
0    RICHARDSON  Y163O8161RUS
1          ROSS   E432XX77RUS
2        MORGAN   7184TT36RUS
3        BAILEY  X582HE161RUS
4         LOPEZ  92918M178RUS
..          ...           ...
526    CAMPBELL  O136HO197RUS
527        HALL  O22097197RUS
528       BAKER  M0309X197RUS
529        DIAZ  O673E8197RUS
530      MORGAN  8610T8154RUS

[531 rows x 2 columns]

In [46]:
np.random.seed(21)
observations_fines = [
    ['K307NA30RUS', np.random.randint(1, 3), np.random.randint(2000, 30000), 'Audi', 'RS7', 2015],
    ['X007OB190RUS', np.random.randint(1, 3), np.random.randint(2000, 30000), 'Kia', 'Rio', 2009],
    ['H729HO170RUS', np.random.randint(1, 3), np.random.randint(2000, 30000), 'BMW', 'Z4', 2019],
    ['K961KC12RUS', np.random.randint(1, 3), np.random.randint(2000, 30000), 'BMW', 'M3', 2021],
    ['B874EH45RUS', np.random.randint(1, 3), np.random.randint(2000, 30000), 'Audi', 'Q5', 2008],
]

df_observations_fines = pd.DataFrame(observations_fines, columns=fines.columns)

In [47]:
fines = fines.append(df_observations_fines, ignore_index=True)

In [49]:
# fines

In [50]:
owners.drop(range(owners.shape[0] - 20, owners.shape[0]), inplace=True)

In [52]:
# owners

In [53]:
np.random.seed(21)
observations_owners = [
    ['LEE', 'К325НС67RUS'],
    ['REED', 'C727YP13RUS'],
    ['CASTILLO', 'У917СО55RUS']
]

df_observations_owners = pd.DataFrame(observations_owners, columns=owners.columns)

In [54]:
owners = owners.append(df_observations_owners, ignore_index=True)

In [56]:
# owners

In [57]:
# fines

In [58]:
# owners

In [59]:
fines.merge(owners, how='inner', on='CarNumber')

        CarNumber  Refund    Fines    Make    Model  Year     SURNAME
0    Y163O8161RUS       2  3200.00    Ford    Focus  1989  RICHARDSON
1    Y163O8161RUS       2  1600.00    Ford    Focus  1980  RICHARDSON
2     E432XX77RUS       1  6500.00  Toyota    Camry  1995        ROSS
3     E432XX77RUS       2 13000.00  Toyota    Camry  2018        ROSS
4     7184TT36RUS       1  2100.00    Ford    Focus  1984      MORGAN
..            ...     ...      ...     ...      ...   ...         ...
894  E41977152RUS       2  2400.00    Ford    Focus  1989       BAKER
895  9464EX178RUS       2  2100.00    Ford    Focus  1988      MARTIN
896  O50197197RUS       2  7800.00    Ford    Focus  1992      WRIGHT
897  7608EE777RUS       1  4000.00   Skoda  Octavia  2000        HILL
898  7608EE777RUS       1  4000.00   Skoda  Octavia  1991        HILL

[899 rows x 7 columns]

In [60]:
fines.merge(owners, how='outer', on='CarNumber')

        CarNumber  Refund    Fines    Make  Model    Year     SURNAME
0    Y163O8161RUS    2.00  3200.00    Ford  Focus 1989.00  RICHARDSON
1    Y163O8161RUS    2.00  1600.00    Ford  Focus 1980.00  RICHARDSON
2     E432XX77RUS    1.00  6500.00  Toyota  Camry 1995.00        ROSS
3     E432XX77RUS    2.00 13000.00  Toyota  Camry 2018.00        ROSS
4     7184TT36RUS    1.00  2100.00    Ford  Focus 1984.00      MORGAN
..            ...     ...      ...     ...    ...     ...         ...
928   K961KC12RUS    2.00 25228.00     BMW     M3 2021.00         NaN
929   B874EH45RUS    1.00 14490.00    Audi     Q5 2008.00         NaN
930   К325НС67RUS     NaN      NaN     NaN    NaN     NaN         LEE
931   C727YP13RUS     NaN      NaN     NaN    NaN     NaN        REED
932   У917СО55RUS     NaN      NaN     NaN    NaN     NaN    CASTILLO

[933 rows x 7 columns]

In [61]:
fines.merge(owners, how='left', on='CarNumber')

        CarNumber  Refund    Fines    Make  Model  Year     SURNAME
0    Y163O8161RUS       2  3200.00    Ford  Focus  1989  RICHARDSON
1     E432XX77RUS       1  6500.00  Toyota  Camry  1995        ROSS
2     7184TT36RUS       1  2100.00    Ford  Focus  1984      MORGAN
3    X582HE161RUS       2  2000.00    Ford  Focus  2015      BAILEY
4    92918M178RUS       1  5700.00    Ford  Focus  2014       LOPEZ
..            ...     ...      ...     ...    ...   ...         ...
925   K307NA30RUS       2  7327.00    Audi    RS7  2015         NaN
926  X007OB190RUS       1 10964.00     Kia    Rio  2009         NaN
927  H729HO170RUS       1 11336.00     BMW     Z4  2019         NaN
928   K961KC12RUS       2 25228.00     BMW     M3  2021         NaN
929   B874EH45RUS       1 14490.00    Audi     Q5  2008         NaN

[930 rows x 7 columns]

In [62]:
fines.merge(owners, how='right', on='CarNumber')

        CarNumber  Refund    Fines    Make    Model    Year     SURNAME
0    Y163O8161RUS    2.00  3200.00    Ford    Focus 1989.00  RICHARDSON
1    Y163O8161RUS    2.00  1600.00    Ford    Focus 1980.00  RICHARDSON
2     E432XX77RUS    1.00  6500.00  Toyota    Camry 1995.00        ROSS
3     E432XX77RUS    2.00 13000.00  Toyota    Camry 2018.00        ROSS
4     7184TT36RUS    1.00  2100.00    Ford    Focus 1984.00      MORGAN
..            ...     ...      ...     ...      ...     ...         ...
897  7608EE777RUS    1.00  4000.00   Skoda  Octavia 2000.00        HILL
898  7608EE777RUS    1.00  4000.00   Skoda  Octavia 1991.00        HILL
899   К325НС67RUS     NaN      NaN     NaN      NaN     NaN         LEE
900   C727YP13RUS     NaN      NaN     NaN      NaN     NaN        REED
901   У917СО55RUS     NaN      NaN     NaN      NaN     NaN    CASTILLO

[902 rows x 7 columns]

## create a pivot table from the fines dataframe, it should look like this (the values are the sums of the fines), but with all the years (the values may be different for you):

In [63]:
fines.pivot_table(index=['Make', 'Model'], columns='Year', values='Fines', aggfunc=np.sum)

Year                    1980      1981      1982     1983     1984      1985  \
Make       Model
Audi       Q5            NaN       NaN       NaN      NaN      NaN       NaN
           RS7           NaN       NaN       NaN      NaN      NaN       NaN
BMW        M3            NaN       NaN       NaN      NaN      NaN       NaN
           Z4            NaN       NaN       NaN      NaN      NaN       NaN
Ford       Focus   110294.59 408983.76 165883.76 64800.00 96989.17 162683.76
           Mondeo        NaN       NaN       NaN      NaN      NaN       NaN
Kia        Rio           NaN       NaN       NaN      NaN      NaN       NaN
Skoda      Octavia   2400.00       NaN   7300.00 11594.59      NaN  10294.59
Toyota     Camry    12000.00   8594.59       NaN  7200.00      NaN       NaN
           Corolla       NaN       NaN   2000.00      NaN      NaN       NaN
Volkswagen Golf     30900.00       NaN       NaN  8594.59   300.00  24000.00
           Jetta         NaN       NaN       NaN      NaN      NaN       NaN
           Passat        NaN   1600.00       NaN  3200.00 10000.00   5000.00
           Touareg       NaN       NaN       NaN      NaN      NaN   5800.00

Year                   1986      1987      1988      1989  ...      2011  \
Make       Model                                           ...
Audi       Q5           NaN       NaN       NaN       NaN  ...       NaN
           RS7          NaN       NaN       NaN       NaN  ...       NaN
BMW        M3           NaN       NaN       NaN       NaN  ...       NaN
           Z4           NaN       NaN       NaN       NaN  ...       NaN
Ford       Focus   96589.17 125700.00 111789.17 176094.59  ... 103478.35
           Mondeo       NaN       NaN       NaN   8600.00  ...       NaN
Kia        Rio          NaN       NaN       NaN       NaN  ...       NaN
Skoda      Octavia   600.00   5200.00   5200.00  91400.00  ...    500.00
Toyota     Camry        NaN       NaN       NaN  22400.00  ...       NaN
           Corolla      NaN  14900.00       NaN   4000.00  ...   8594.59
Volkswagen Golf         NaN  44800.00       NaN   5800.00  ...    300.00
           Jetta        NaN       NaN       NaN       NaN  ...       NaN
           Passat  15000.00  12300.00       NaN       NaN  ...       NaN
           Touareg      NaN       NaN       NaN       NaN  ...       NaN

Year                   2012      2013      2014      2015     2016      2017  \
Make       Model
Audi       Q5           NaN       NaN       NaN       NaN      NaN       NaN
           RS7          NaN       NaN       NaN   7327.00      NaN       NaN
BMW        M3           NaN       NaN       NaN       NaN      NaN       NaN
           Z4           NaN       NaN       NaN       NaN      NaN       NaN
Ford       Focus   97100.00 139394.59 122678.35 209100.00 98089.17 263000.00
           Mondeo  34400.00       NaN       NaN       NaN 46200.00       NaN
Kia        Rio          NaN       NaN       NaN       NaN      NaN       NaN
Skoda      Octavia   500.00  12594.59    300.00  46394.59   300.00   8594.59
Toyota     Camry    8594.59       NaN   1000.00       NaN      NaN       NaN
           Corolla 30300.00       NaN       NaN       NaN   900.00   9600.00
Volkswagen Golf         NaN  20800.00       NaN   2300.00      NaN       NaN
           Jetta        NaN       NaN       NaN       NaN      NaN       NaN
           Passat       NaN       NaN       NaN    600.00  2100.00       NaN
           Touareg      NaN       NaN   1300.00    500.00      NaN       NaN

Year                    2018     2019     2021
Make       Model
Audi       Q5            NaN      NaN      NaN
           RS7           NaN      NaN      NaN
BMW        M3            NaN      NaN 25228.00
           Z4            NaN 11336.00      NaN
Ford       Focus   274089.17 78889.17      NaN
           Mondeo        NaN      NaN      NaN
Kia        Rio           NaN      NaN      NaN
Skoda      Octavia 156200.00  9500.00      NaN
Toyota     Camry    21594.59 18100.00      NaN
           Corolla   7600.00      NaN      NaN
Volkswagen Golf      1000.00      NaN      NaN
           Jetta         NaN      NaN      NaN
           Passat        NaN      NaN      NaN
           Touareg       NaN      NaN      NaN

[14 rows x 41 columns]

## save both the fines and owners dataframes to CSV files without an index

In [64]:
fines.to_csv('../data/fines.csv', index=False)

In [65]:
owners.to_csv('../data/owners.csv', index=False)